app/Controllers/Admin.php

    public function index(): string
    {
        $productoModel = new ProductosModel();
        $usuarioModel = new UsuarioModel();
        $facturaModel = new FacturaModel();
        $consultaModel = new ConsultaModel();
        $contactoModel = new ContactoModel();
        $carritoModel = new ItemCarritoModel();

        $data = [
        'titulo' => 'Principal',
        'usuarios' => $usuarioModel->countAll(),
        'productos' => $productoModel->countAll(),
        'stockBajo' => $productoModel->where('stock >', 0)->where('stock <', 10)->countAllResults(),
        'sinStock' => $productoModel->where('stock', 0)->countAllResults(),
        'consultasSinResponder' => $consultaModel->where('activo', 1)->countAllResults() + $contactoModel->where('activo', 1)->countAllResults(),
        'carritosAbandonados' => $carritoModel->countAll()
---
SELECT COUNT(*) AS `numrows` FROM `usuario`
SELECT COUNT(*) AS `numrows` FROM `productos`
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `stock` > 0
AND `stock` < 10
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `stock` = 0
SELECT COUNT(*) AS `numrows` FROM `item_carrito`

    public function productos()
    {
        $categoriasModel = new CategoriaModel();
        $productoModel = new ProductosModel();
        $productoModel->desactivarProductosSinStock();
        $resultado = $productoModel->obtenerProductosConEquipo();
        $data['titulo'] = 'Productos';
        $data['lista_productos'] = $resultado;
        $data['categorias'] = $categoriasModel->findAll();
---
SELECT *
FROM `categoria`

    public function listarFacturas()
{
    $facturaModel = new FacturaModel();

    $facturas = $facturaModel
        ->select('factura.id_factura, factura.fecha, usuario.nombre, usuario.apellido, usuario.email')
        ->join('usuario', 'usuario.id_usuario = factura.id_usuario')
        ->where('factura.activo', 1)
        ->orderBy('factura.fecha', 'DESC')
        ->findAll();
---
SELECT `factura`.`id_factura`, `factura`.`fecha`, `usuario`.`nombre`, `usuario`.`apellido`, `usuario`.`email`
FROM `factura`
JOIN `usuario` ON `usuario`.`id_usuario` = `factura`.`id_usuario`
WHERE `factura`.`activo` = 1
ORDER BY `factura`.`fecha` DESC

    public function usuariosRegistrados(){
        $usuarioModel = new UsuarioModel();
        $usuarios = $usuarioModel->findAll();
---
SELECT *
FROM `usuario`