app/Controllers/Carrito.php

public function finalizarCompra()
{
    $session = session();
    $idUsuario = $session->get('userid');

    // Obtener carrito desde la base de datos
    $carritoModel = new ItemCarritoModel();
    $carrito = $carritoModel->where('id_usuario', $idUsuario)->findAll();

    if (empty($carrito)) {
        return redirect()->back()->with('error', 'El carrito está vacío.');
    }

    // Modelos necesarios
    $productoModel = new ProductosModel();
    $facturaModel = new FacturaModel();
    $detalleModel = new DetalleFacturaModel();

    // Calcular total
    $total = 0;
    foreach ($carrito as $item) {
        $producto = $productoModel->find($item['id_producto']);
---
SELECT *
FROM `item_carrito`
WHERE `id_usuario` = '1'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '3'

        'total'       => $total + 3000,
        'activo'      => 1
    ];
    $facturaId = $facturaModel->insert($facturaData, true);

    // Guardar detalles y actualizar producto
    foreach ($carrito as $item) {
        $producto = $productoModel->find($item['id_producto']);
---
INSERT INTO `factura` (`id_usuario`, `costo_envio`, `total`, `activo`, `fecha`) VALUES ('1', 3000, 49100, 1, '2025-06-17 21:14:59')
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '3'

        $nuevoStock = $producto['stock'] - $item['cantidad'];
        $nuevaCantidadVendida = ($producto['cantidad_vendida'] ?? 0) + $item['cantidad'];

        $productoModel->update($item['id_producto'], [
            'stock'            => $nuevoStock,
            'cantidad_vendida' => $nuevaCantidadVendida
        ]);
    }

    // Vaciar carrito desde base de datos
    $carritoModel->where('id_usuario', $idUsuario)->delete();
---
UPDATE `productos` SET `stock` = 37, `cantidad_vendida` = 5
WHERE `productos`.`id_producto` IN ('3')
DELETE FROM `item_carrito`
WHERE `id_usuario` = '1'