app/Controllers/Home.php

    public function index(){
        $productoModel = new ProductosModel();

        // 5 más vendidas
        $masVendidas = $productoModel->where('activo', 1)
                                    ->orderBy('cantidad_vendida', 'DESC')
                                    ->findAll(5);

        // 15 de ofertas del día
        $ofertas = $productoModel->where('activo', true)
                                ->where('precio_descuento IS NOT NULL')
                                ->where('precio_descuento !=', 0)
                                ->findAll(15);

        // 8 camisetas de Messi
        $messi = $productoModel->where(['activo' => true, 'jugador_relevante' => 'Messi'])
                            ->findAll(8);

        // 8 camisetas de Maradona
        $maradona = $productoModel->where(['activo' => true, 'jugador_relevante' => 'Maradona'])
                                ->findAll(8);
---
SELECT *
FROM `productos`
WHERE `activo` = 1
ORDER BY `cantidad_vendida` DESC
 LIMIT 5
SELECT *
FROM `productos`
WHERE `activo` = 1
AND `precio_descuento` IS NOT NULL
AND `precio_descuento` != 0
 LIMIT 16
SELECT *
FROM `productos`
WHERE `activo` = 1
AND `jugador_relevante` = 'Messi'
 LIMIT 8
SELECT *
FROM `productos`
WHERE `activo` = 1
AND `jugador_relevante` = 'Maradona'
 LIMIT 8

    public function catalogo() {
    $productoModel = new ProductosModel();
    $productoModel->desactivarProductosSinStock();

    $termino = $this->request->getGet('q');
    $equipo = $this->request->getGet('equipo');
    $jugador = $this->request->getGet('jugador');

    $builder = $productoModel->where('activo', 1);

    // Filtro por búsqueda general
    if (!empty($termino)) {
        $builder->groupStart()
            ->like('nombre', $termino)
            ->orLike('jugador_relevante', $termino)
            ->groupEnd();
    }

    // Filtro por equipo (categoría)
    if (!empty($equipo)) {
        $builder->where('id_categoria', $equipo);
    }

    // Filtro por jugador
    if (!empty($jugador)) {
        $builder->like('jugador_relevante', $jugador);
    }

    $resultado = $builder->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1

    $db = \Config\Database::connect();

    // Traer categorías desde la tabla 'categorias'
    $categorias = $db->table('categoria')
                     ->select('id_categoria, equipo')
                     ->orderBy('equipo', 'ASC')
                     ->get()
                     ->getResultArray();

    // Traer jugadores únicos desde productos
    $jugadores = $db->table('productos')
                    ->select('jugador_relevante')
                    ->distinct()
                    ->where('activo', 1)
                    ->where('jugador_relevante IS NOT NULL')
                    ->where('jugador_relevante !=', '')
                    ->orderBy('jugador_relevante', 'ASC')
                    ->get()
                    ->getResultArray();
---
SELECT `id_categoria`, `equipo`
FROM `categoria`
ORDER BY `equipo` ASC
SELECT DISTINCT `jugador_relevante`
FROM `productos`
WHERE `activo` = 1
AND `jugador_relevante` IS NOT NULL
AND `jugador_relevante` != ''
ORDER BY `jugador_relevante` ASC

    public function facturas()
{
    $session = session();
    $id_usuario = $session->get('userid');

    $facturaModel = new \App\Models\FacturaModel();

    $facturas = $facturaModel
                    ->where('id_usuario', $id_usuario)
                    ->orderBy('fecha', 'DESC')
                    ->findAll();
---
SELECT *
FROM `factura`
WHERE `id_usuario` IS NULL
ORDER BY `fecha` DESC