app/Controllers/Usuarios.php

INSERT INTO `usuario` (`nombre`, `apellido`, `email`, `contraseña`, `rol`) VALUES ('Juan ', 'Veron', 'veroncito123@gmail.com', '$2y$10$Le8ESP18n0ZknXhzrjQQduaHwd0icxtV3xbhGt/h./D9DIM9BwpcW', 'usuario')
---
    public function create()
    {
        $rules = [

            'nombre' => 'required|max_length[100]',
            'apellido' => 'required|max_length[100]',
            'email' => 'required|max_length[80]|is_unique[usuario.email]',
            'password' => 'required|max_length[50]|min_length[8]',
            'repassword' => 'matches[password]'
        ];

        if(!$this->validate($rules)){
            return redirect()->back()->withInput()->with('errors', $this->validator->listErrors());
        }

        $userModel = new UsuarioModel();
        $post = $this->request->getPost(['nombre', 'apellido', 'email', 'password']);

        $token = bin2hex(random_bytes(20));

        $userModel->insert([
            'nombre' => $post['nombre'],
            'apellido' => $post['apellido'],
            'email' => $post['email'],
            'contraseña' => password_hash($post['password'], PASSWORD_DEFAULT),
            'rol' => "usuario",

        ]);