app/Models/ItemCarritoModel.php

    public function consultarCarrito(){
        $session = session();
        $id_usuario = $session->get('userid');

        $itemCarritoModel = new ItemCarritoModel();
        $hayProductosEnCarrito = $itemCarritoModel
            ->where('id_usuario', $id_usuario)
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `item_carrito`
WHERE `id_usuario` IS NULL