app/Models/ProductosModel.php

    public function obtenerProductosConEquipo() {
        return $this->select('productos.*, categoria.equipo')
                    ->join('categoria', 'categoria.id_categoria = productos.id_categoria')
                    ->where('productos.activo', 1)
                    ->where('productos.stock >', 0)
                    ->findAll();
---
SELECT `productos`.*, `categoria`.`equipo`
FROM `productos`
JOIN `categoria` ON `categoria`.`id_categoria` = `productos`.`id_categoria`
WHERE `productos`.`activo` = 1
AND `productos`.`stock` > 0

    public function desactivarProductosSinStock() {
        // Encuentra productos activos con stock <= 0
        $productosSinStock = $this->where('activo', 1)
                                ->where('stock <=', 0)
                                ->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1
AND `stock` <= 0